# Python for Managers | Classroom | 2021

-----
## Pandas
-----

In [1]:
import pandas as pd # pandas is especially powerful for loading and manipulating data

### Getting data
This will be provided during the challenge.

In [2]:
# The datatype of data is a dictionary.
data = {"Country": ["Belgium", "India", "Brazil"],
       "Capital": ["Brussels", "New Delhi", "Brasilia"],
       "Population": [11190846, 1303171035, 207847528]}
print(type(data))

<class 'dict'>

In [3]:
print(data)

{'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasilia'], 'Population': [11190846, 1303171035, 207847528]}

In [4]:
df = pd.DataFrame(data, columns=["Country", "Capital", "Population"])

### Get to know your data

In [5]:
df.head()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [6]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [7]:
df.shape

(3, 3)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [9]:
df.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [10]:
df["Population"]

0      11190846
1    1303171035
2     207847528
Name: Population, dtype: int64

In [11]:
df["Population"].values

array([  11190846, 1303171035,  207847528], dtype=int64)

In [12]:
df["Population"].index

RangeIndex(start=0, stop=3, step=1)

### Make use of built-in functions

In [13]:
df['Population'].mean()

507403136.3333333

In [14]:
df['Population'].sum()

1522209409

In [15]:
df['Country'].value_counts()

Brazil     1
Belgium    1
India      1
Name: Country, dtype: int64

### Filter the data

In [16]:
df[df["Population"] > 1e9] # "Show the part of the dataframe where the population column is bigger than a billion"

  Country    Capital  Population
1   India  New Delhi  1303171035

# Indexing `.iloc` vs `.loc`

In [20]:
df.head()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [19]:
df.iloc[[0], [2]]

   Population
0    11190846

In [22]:
df.loc[[2], ["Country"]]

  Country
2  Brazil

### Add new columns

In [23]:
df.loc[[0], "Continent"] = "Europe"
df.loc[[1], "Continent"] = "Asia"
df.loc[[2], "Continent"] = "South America"

In [24]:
df.head()

   Country    Capital  Population      Continent
0  Belgium   Brussels    11190846         Europe
1    India  New Delhi  1303171035           Asia
2   Brazil   Brasilia   207847528  South America

### Add new rows

In [25]:
df = df.append({"Country": "Australia", "Capital": "Canberra", "Population": 25499884, "Continent": "Australia"}, ignore_index=True) # don't forget to update df by using df = ...

In [26]:
df.head()

     Country    Capital  Population      Continent
0    Belgium   Brussels    11190846         Europe
1      India  New Delhi  1303171035           Asia
2     Brazil   Brasilia   207847528  South America
3  Australia   Canberra    25499884      Australia

### Delete a row/column

In [30]:
df.drop("Country", axis=1)

     Capital  Population      Continent
0   Brussels    11190846         Europe
1  New Delhi  1303171035           Asia
2   Brasilia   207847528  South America
3   Canberra    25499884      Australia

In [24]:
df.drop("Country", axis=1)

     Capital  Population      Continent
0   Brussels    11190846         Europe
1  New Delhi  1303171035           Asia
2   Brasilia   207847528  South America
3   Canberra    25499884      Australia

In [25]:
df.head()

     Country    Capital  Population      Continent
0    Belgium   Brussels    11190846         Europe
1      India  New Delhi  1303171035           Asia
2     Brazil   Brasilia   207847528  South America
3  Australia   Canberra    25499884      Australia